constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType        RAS;

RAS
{
    RASModel          kEpsilon;

    turbulence        on;

    printCoeffs       on;

    kEpsilonCoeffs
    {
        Cmu           0.09;
        sigmaEps      1.30;
        sigmaK        1.0;
        C1            1.44;
        C2            1.92;
    }
}


// ************************************************************************* //
