0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (-2 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (-2 0 0);
    }

    gas
    {
        type                flowRateInletVelocity;
        massFlowRate        3.32;
        value               uniform (0 1 0);
    }

    open
    {
        type                fixedValue;
        value               $internalField;
    }

    wall
    {
        type            fixedValue;
        value           $internalField;
    }

    wall2
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
