0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    gas
    {
        type            calculated;
        value           $internalField;
    }

    open
    {
        type            calculated;
        value           $internalField;
    }

    wall
    {
        type            atmAlphatkWallFunction;
        Pr              0.90;
        Prt             uniform 0.85;
        z0              uniform 0.001;
        Cmu             0.09;
        kappa           0.41;
        value           uniform 0;
    }
    
    wall2
    {
        type            atmAlphatkWallFunction;
        Pr              0.90;
        Prt             uniform 0.85;
        z0              uniform 0.001;
        Cmu             0.09;
        kappa           0.41;
        value           uniform 0;
    }    

}


// ************************************************************************* //
