0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000567;

boundaryField
{

    wall
    {
        type        atmEpsilonWallFunction;
        kappa       0.41;
        cmu         0.91;
        z0          uniform 0.001;
        value       uniform 0.0;
    }

    gas
    {
        type        inletOutlet;
        inletValue  uniform 0.000567;
        value       $internalField;
    }

    inlet
    {
        type        inletOutlet;
        inletValue  uniform 0.000567;
        value       $internalField;
    }

    open
    {
        type        inletOutlet;
        inletValue  uniform 0.000567;
        value       $internalField;
    }

    wall2
    {
        type        atmEpsilonWallFunction;
        kappa       0.41;
        cmu         0.91;
        z0          uniform 0.001;
        value       uniform 0.0;
    }


}

// ************************************************************************* //
