0/k
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.006059;

boundaryField
{

    wall
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    gas
    {
        type            fixedValue;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    open
    {
        type            fixedValue;
        value           $internalField;
    }

    wall2
    {
        type        kqRWallFunction;
        value       $internalField;
    }
}

// ************************************************************************* //
