0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    gas
    {
        type            calculated;
        value           $internalField;
    }

    open
    {
        type            calculated;
        value           $internalField;
    }

    wall
    {
        type            atmNutkWallFunction;
        cmu             0.09;
        kappa           0.41;
        z0              uniform 0.001;
        value           uniform 0.0;
    }

    wall2
    {
        type            atmNutkWallFunction;
        cmu             0.09;
        kappa           0.41;
        z0              uniform 0.001;
        value           uniform 0.0;
    }

}


// ************************************************************************* //
